#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-qiC51i1Vcmt7NScu

Waiting for the plan to start...

Terraform v1.5.0
on linux_amd64
Initializing plugins and modules...
2023-06-19T03:04:11.890Z [INFO]  Terraform version: 1.5.0
2023-06-19T03:04:11.890Z [DEBUG] using github.com/hashicorp/go-tfe v1.26.0
2023-06-19T03:04:11.890Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.16.2
2023-06-19T03:04:11.890Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.0
2023-06-19T03:04:11.890Z [DEBUG] using github.com/zclconf/go-cty v1.12.2
2023-06-19T03:04:11.890Z [INFO]  Go runtime version: go1.20
2023-06-19T03:04:11.890Z [INFO]  CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-06-19T03:04:11.890Z [DEBUG] Attempting to open CLI config file: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/.terraformrc
2023-06-19T03:04:11.890Z [INFO]  Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/.terraformrc
2023-06-19T03:04:11.891Z [DEBUG] checking for credentials in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/.terraform.d/plugins"
2023-06-19T03:04:11.891Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-06-19T03:04:11.891Z [DEBUG] will search for provider plugins in /home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/.terraform.d/plugins
2023-06-19T03:04:11.892Z [DEBUG] ignoring non-existing provider search directory /home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/.local/share/terraform/plugins
2023-06-19T03:04:11.892Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2023-06-19T03:04:11.892Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2023-06-19T03:04:11.893Z [INFO]  CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-06-19T03:04:11.897Z [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-06-19T03:04:11.916Z [DEBUG] Service discovery for app.terraform.io aliased as localterraform.com
2023-06-19T03:04:13.099Z [DEBUG] checking for provisioner in "."
2023-06-19T03:04:13.099Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/bin"
2023-06-19T03:04:13.099Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/.terraform.d/plugins"
2023-06-19T03:04:13.338Z [INFO]  backend/local: starting Plan operation
2023-06-19T03:04:13.498Z [DEBUG] backend/local: Skipping interactive prompts for variables because input is disabled
2023-06-19T03:04:13.498Z [DEBUG] Building and walking validate graph
2023-06-19T03:04:13.498Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config" (*terraform.NodeValidatableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:13.498Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" (*terraform.NodeValidatableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:13.498Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance" (*terraform.NodeValidatableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:13.498Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:13.498Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/null"]
2023-06-19T03:04:13.498Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/random"]
2023-06-19T03:04:13.499Z [DEBUG] created provider logger: level=debug
2023-06-19T03:04:13.499Z [INFO]  provider: configuring client automatic mTLS
2023-06-19T03:04:13.530Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5]
2023-06-19T03:04:13.532Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=64
2023-06-19T03:04:13.532Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5
2023-06-19T03:04:13.817Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-19T03:04:13.817Z
2023-06-19T03:04:13.836Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: plugin address: address=/tmp/plugin1828579439 network=unix timestamp=2023-06-19T03:04:13.835Z
2023-06-19T03:04:13.836Z [DEBUG] provider: using plugin: version=5
2023-06-19T03:04:14.276Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-19T03:04:14.276Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=64
2023-06-19T03:04:14.277Z [DEBUG] provider: plugin exited
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config" references: [module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand)]
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" references: [module.ec2.var.min_size (expand) module.ec2.var.desired_capacity (expand) module.ec2.var.max_size (expand) module.ec2.var.subnet_id (expand) module.ec2.aws_launch_configuration.launch_config]
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.var.min_size (expand)" references: []
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.var.max_size (expand)" references: []
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2 (expand)" references: []
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance" references: [module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand) module.ec2.var.subnet_id (expand)]
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.var.desired_capacity (expand)" references: []
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.var.aws_region (expand)" references: []
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.var.ami_id (expand)" references: []
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.var.subnet_id (expand)" references: []
2023-06-19T03:04:14.277Z [DEBUG] ReferenceTransformer: "module.ec2.var.instance_type (expand)" references: []
2023-06-19T03:04:14.278Z [DEBUG] ReferenceTransformer: "module.ec2 (close)" references: []
2023-06-19T03:04:14.278Z [DEBUG] ReferenceTransformer: "module.ec2.provider[\"registry.terraform.io/hashicorp/aws\"]" references: [module.ec2.var.aws_region (expand)]
2023-06-19T03:04:14.278Z [DEBUG] Starting graph walk: walkValidate
2023-06-19T03:04:14.279Z [DEBUG] created provider logger: level=debug
2023-06-19T03:04:14.280Z [INFO]  provider: configuring client automatic mTLS
2023-06-19T03:04:14.293Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5]
2023-06-19T03:04:14.296Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=91
2023-06-19T03:04:14.296Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5
2023-06-19T03:04:14.586Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-19T03:04:14.586Z
2023-06-19T03:04:14.605Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: plugin address: address=/tmp/plugin1283733905 network=unix timestamp=2023-06-19T03:04:14.605Z
2023-06-19T03:04:14.605Z [DEBUG] provider: using plugin: version=5
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_attribute_path=allowed_account_ids tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_attribute_path=allowed_account_ids tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_attribute_path=shared_config_files tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_attribute_path=shared_config_files tf_mux_provider=*proto5server.Server tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_attribute_path=forbidden_account_ids tf_mux_provider=*proto5server.Server @module=sdk.framework tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_attribute_path=forbidden_account_ids tf_mux_provider=*proto5server.Server tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig @module=sdk.framework @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_attribute_path=shared_credentials_files tf_mux_provider=*proto5server.Server timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.971Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_mux_provider=*proto5server.Server @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_attribute_path=shared_credentials_files tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_attribute_path=max_retries tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @module=sdk.framework tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_provider_addr=registry.terraform.io/hashicorp/aws @module=sdk.framework tf_attribute_path=max_retries tf_mux_provider=*proto5server.Server tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.971Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_rpc=PrepareProviderConfig @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_rpc=PrepareProviderConfig tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws description="list must contain at most 1 elements" tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_rpc=PrepareProviderConfig tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_mux_provider=*proto5server.Server timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: tf_mux_provider=*proto5server.Server @module=sdk.framework description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.972Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 description="list must contain at most 1 elements" tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.973Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.973Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_provider_addr=registry.terraform.io/hashicorp/aws @module=sdk.framework tf_mux_provider=*proto5server.Server timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.973Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d description="list must contain at most 1 elements" tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.973Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 @module=sdk.framework tf_req_id=6e26b00b-8b52-664a-3d45-77807d971a3d timestamp=2023-06-19T03:04:14.972Z
2023-06-19T03:04:14.979Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-19T03:04:14.979Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=91
2023-06-19T03:04:14.979Z [DEBUG] provider: plugin exited
2023-06-19T03:04:14.979Z [INFO]  backend/local: plan calling Plan
2023-06-19T03:04:14.979Z [DEBUG] Building and walking plan graph for NormalMode
2023-06-19T03:04:14.980Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance (expand)" (*terraform.nodeExpandPlannableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:14.980Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" (*terraform.nodeExpandPlannableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:14.980Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" (*terraform.nodeExpandPlannableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:14.980Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:14.980Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/null"]
2023-06-19T03:04:14.980Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/random"]
2023-06-19T03:04:14.980Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" references: [module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand)]
2023-06-19T03:04:14.980Z [DEBUG] ReferenceTransformer: "module.ec2 (close)" references: []
2023-06-19T03:04:14.980Z [DEBUG] ReferenceTransformer: "module.ec2.var.min_size (expand)" references: []
2023-06-19T03:04:14.980Z [DEBUG] ReferenceTransformer: "module.ec2.var.desired_capacity (expand)" references: []
2023-06-19T03:04:14.980Z [DEBUG] ReferenceTransformer: "module.ec2.var.aws_region (expand)" references: []
2023-06-19T03:04:14.980Z [DEBUG] ReferenceTransformer: "module.ec2.provider[\"registry.terraform.io/hashicorp/aws\"]" references: [module.ec2.var.aws_region (expand)]
2023-06-19T03:04:14.980Z [DEBUG] ReferenceTransformer: "module.ec2.var.instance_type (expand)" references: []
2023-06-19T03:04:14.981Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance (expand)" references: [module.ec2.var.subnet_id (expand) module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand)]
2023-06-19T03:04:14.981Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" references: [module.ec2.aws_launch_configuration.launch_config (expand) module.ec2.var.min_size (expand) module.ec2.var.max_size (expand) module.ec2.var.subnet_id (expand) module.ec2.var.desired_capacity (expand)]
2023-06-19T03:04:14.981Z [DEBUG] ReferenceTransformer: "module.ec2.var.ami_id (expand)" references: []
2023-06-19T03:04:14.981Z [DEBUG] ReferenceTransformer: "module.ec2.var.subnet_id (expand)" references: []
2023-06-19T03:04:14.981Z [DEBUG] ReferenceTransformer: "module.ec2.var.max_size (expand)" references: []
2023-06-19T03:04:14.981Z [DEBUG] ReferenceTransformer: "module.ec2 (expand)" references: []
2023-06-19T03:04:14.982Z [DEBUG] Starting graph walk: walkPlan
2023-06-19T03:04:14.982Z [DEBUG] created provider logger: level=debug
2023-06-19T03:04:14.983Z [INFO]  provider: configuring client automatic mTLS
2023-06-19T03:04:14.994Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5]
2023-06-19T03:04:14.997Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=111
2023-06-19T03:04:14.997Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5
2023-06-19T03:04:15.290Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: configuring server automatic mTLS: timestamp=2023-06-19T03:04:15.290Z
2023-06-19T03:04:15.309Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: plugin address: address=/tmp/plugin1418522110 network=unix timestamp=2023-06-19T03:04:15.308Z
2023-06-19T03:04:15.309Z [DEBUG] provider: using plugin: version=5
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_attribute_path=shared_credentials_files tf_rpc=PrepareProviderConfig tf_mux_provider=*proto5server.Server tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_attribute_path=shared_credentials_files tf_rpc=PrepareProviderConfig tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_attribute_path=max_retries tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_attribute_path=max_retries tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_attribute_path=shared_config_files tf_mux_provider=*proto5server.Server tf_rpc=PrepareProviderConfig @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_attribute_path=shared_config_files tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_attribute_path=forbidden_account_ids tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @module=sdk.framework tf_mux_provider=*proto5server.Server tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig tf_attribute_path=forbidden_account_ids tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_attribute_path=allowed_account_ids tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 @module=sdk.framework tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.645Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @module=sdk.framework tf_attribute_path=allowed_account_ids tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 timestamp=2023-06-19T03:04:15.645Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 @module=sdk.framework tf_mux_provider=*proto5server.Server timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 @module=sdk.framework description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_mux_provider=*proto5server.Server tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server @module=sdk.framework timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: @module=sdk.framework description="list must contain at most 1 elements" tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 @module=sdk.framework tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig description="list must contain at most 1 elements" timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 @module=sdk.framework timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.646Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @module=sdk.framework @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:15.646Z
2023-06-19T03:04:15.647Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Type Validate: @module=sdk.framework tf_mux_provider=*proto5server.Server @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:81 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:15.647Z
2023-06-19T03:04:15.647Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Type Validate: @module=sdk.framework tf_rpc=PrepareProviderConfig tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwschemadata/data_value.go:83 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:15.647Z
2023-06-19T03:04:15.647Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined validator.List: tf_mux_provider=*proto5server.Server tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:217 @module=sdk.framework description="list must contain at most 1 elements" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=PrepareProviderConfig timestamp=2023-06-19T03:04:15.647Z
2023-06-19T03:04:15.647Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined validator.List: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=4be3ac84-4c20-df60-a442-b02391025c98 tf_rpc=PrepareProviderConfig @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/block_validation.go:227 @module=sdk.framework description="list must contain at most 1 elements" tf_mux_provider=*proto5server.Server timestamp=2023-06-19T03:04:15.647Z
2023-06-19T03:04:15.650Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Configuring Terraform AWS Provider: @caller=github.com/hashicorp/terraform-provider-aws/internal/conns/config.go:141 tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @module=aws timestamp=2023-06-19T03:04:15.650Z
2023-06-19T03:04:15.650Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Resolving credentials provider: tf_mux_provider=*schema.GRPCProviderServer tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2023-06-19T03:04:15.650Z
2023-06-19T03:04:15.651Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Loading configuration: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 tf_mux_provider=*schema.GRPCProviderServer @module=aws.aws-base timestamp=2023-06-19T03:04:15.650Z
2023-06-19T03:04:15.651Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving credentials: tf_mux_provider=*schema.GRPCProviderServer @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider timestamp=2023-06-19T03:04:15.651Z
2023-06-19T03:04:15.651Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: Retrieved credentials: tf_mux_provider=*schema.GRPCProviderServer tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 tf_aws.credentials_source=EnvConfigCredentials @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2023-06-19T03:04:15.651Z
2023-06-19T03:04:15.651Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Loading configuration: @module=aws.aws-base tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:15.651Z
2023-06-19T03:04:15.651Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving caller identity from STS: tf_mux_provider=*schema.GRPCProviderServer tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 timestamp=2023-06-19T03:04:15.651Z
2023-06-19T03:04:15.652Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Request Sent: @module=aws.aws-base http.request.header.content_type=application/x-www-form-urlencoded tf_rpc=ConfigureProvider http.request.header.x_amz_date=20230619T030415Z tf_mux_provider=*schema.GRPCProviderServer tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 aws.operation=GetCallerIdentity aws.service=STS http.method=POST http.request.body="Action=GetCallerIdentity&Version=2011-06-15
" net.peer.name=sts.us-east-1.amazonaws.com tf_provider_addr=registry.terraform.io/hashicorp/aws http.request.header.amz_sdk_invocation_id=e07ac9be-43fd-449b-95bc-61831ade0991 http.request_content_length=43 http.user_agent="APN/1.0 HashiCorp/1.0 Terraform/1.5.0 (+https://www.terraform.io) terraform-provider-aws/5.4.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go-v2/1.18.1 os/linux lang/go/1.19.9 md/GOOS/linux md/GOARCH/amd64 api/sts/1.19.1" aws.region=us-east-1 aws.sdk=aws-sdk-go-v2 http.request.header.amz_sdk_request="attempt=1; max=25" http.request.header.authorization="AWS4-HMAC-SHA256 Credential=AKIA************WPFS/20230619/us-east-1/sts/aws4_request, SignedHeaders=amz-sdk-invocation-id;amz-sdk-request;content-length;content-type;host;x-amz-date, Signature=*****" http.url=https://sts.us-east-1.amazonaws.com/ timestamp=2023-06-19T03:04:15.652Z
2023-06-19T03:04:15.672Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Response Received: http.response_content_length=406 @module=aws.aws-base aws.region=us-east-1 aws.sdk=aws-sdk-go-v2 http.response.header.content_type=text/xml http.response.header.date="Mon, 19 Jun 2023 03:04:15 GMT" http.response.header.x_amzn_requestid=c2b36b84-0c50-4b22-8373-99d5ac640fd5 aws.service=STS http.status_code=200 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider aws.operation=GetCallerIdentity http.duration=19 http.response.body="<GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::801210904757:user/terraform</Arn>
    <UserId>AIDA*************EC5P</UserId>
    <Account>801210904757</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>c2b36b84-0c50-4b22-8373-99d5ac640fd5</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>
" timestamp=2023-06-19T03:04:15.671Z
2023-06-19T03:04:15.672Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: Retrieved caller identity from STS: tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_mux_provider=*schema.GRPCProviderServer tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b timestamp=2023-06-19T03:04:15.672Z
2023-06-19T03:04:15.672Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Creating AWS SDK v1 session: tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws @module=aws tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @caller=github.com/hashicorp/terraform-provider-aws/internal/conns/config.go:154 timestamp=2023-06-19T03:04:15.672Z
2023-06-19T03:04:15.672Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving AWS account details: tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @caller=github.com/hashicorp/terraform-provider-aws/internal/conns/config.go:160 @module=aws tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2023-06-19T03:04:15.672Z
2023-06-19T03:04:15.672Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Retrieving caller identity from STS: @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_mux_provider=*schema.GRPCProviderServer tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 timestamp=2023-06-19T03:04:15.672Z
2023-06-19T03:04:15.672Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Request Sent: @module=aws.aws-base http.request.body="Action=GetCallerIdentity&Version=2011-06-15
" http.request.header.amz_sdk_invocation_id=d6a3979f-77a4-4688-bfcd-857e036b5e18 http.request.header.authorization="AWS4-HMAC-SHA256 Credential=AKIA************WPFS/20230619/us-east-1/sts/aws4_request, SignedHeaders=amz-sdk-invocation-id;amz-sdk-request;content-length;content-type;host;x-amz-date, Signature=*****" http.user_agent="APN/1.0 HashiCorp/1.0 Terraform/1.5.0 (+https://www.terraform.io) terraform-provider-aws/5.4.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go-v2/1.18.1 os/linux lang/go/1.19.9 md/GOOS/linux md/GOARCH/amd64 api/sts/1.19.1" aws.region=us-east-1 aws.sdk=aws-sdk-go-v2 aws.service=STS http.request_content_length=43 tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 http.method=POST http.request.header.amz_sdk_request="attempt=1; max=25" net.peer.name=sts.us-east-1.amazonaws.com tf_rpc=ConfigureProvider aws.operation=GetCallerIdentity http.request.header.content_type=application/x-www-form-urlencoded http.request.header.x_amz_date=20230619T030415Z http.url=https://sts.us-east-1.amazonaws.com/ tf_mux_provider=*schema.GRPCProviderServer tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b timestamp=2023-06-19T03:04:15.672Z
2023-06-19T03:04:15.675Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: HTTP Response Received: http.response_content_length=406 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:41 @module=aws.aws-base aws.sdk=aws-sdk-go-v2 http.response.header.x_amzn_requestid=354e0e43-76ac-4039-9ac4-7fd18f1e025c tf_rpc=ConfigureProvider http.response.body="<GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::801210904757:user/terraform</Arn>
    <UserId>AIDA*************EC5P</UserId>
    <Account>801210904757</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>354e0e43-76ac-4039-9ac4-7fd18f1e025c</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>
" http.status_code=200 tf_mux_provider=*schema.GRPCProviderServer aws.operation=GetCallerIdentity aws.region=us-east-1 http.duration=2 http.response.header.date="Mon, 19 Jun 2023 03:04:15 GMT" aws.service=STS http.response.header.content_type=text/xml timestamp=2023-06-19T03:04:15.675Z
2023-06-19T03:04:15.675Z [INFO]  provider.terraform-provider-aws_v5.4.0_x5: Retrieved caller identity from STS: tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.29/logging/logger.go:33 @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer timestamp=2023-06-19T03:04:15.675Z
2023-06-19T03:04:15.679Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Calling provider defined Provider Configure: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/server_configureprovider.go:15 tf_mux_provider=*proto5server.Server tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider @module=sdk.framework timestamp=2023-06-19T03:04:15.679Z
2023-06-19T03:04:15.679Z [DEBUG] provider.terraform-provider-aws_v5.4.0_x5: Called provider defined Provider Configure: @caller=github.com/hashicorp/terraform-plugin-framework@v1.3.1/internal/fwserver/server_configureprovider.go:23 tf_provider_addr=registry.terraform.io/hashicorp/aws @module=sdk.framework tf_mux_provider=*proto5server.Server tf_req_id=c0c0fd6d-31c1-a5c8-be33-80c476f98d0b tf_rpc=ConfigureProvider timestamp=2023-06-19T03:04:15.679Z
2023-06-19T03:04:15.680Z [DEBUG] Resource instance state not found for node "module.ec2.aws_launch_configuration.launch_config", instance module.ec2.aws_launch_configuration.launch_config
2023-06-19T03:04:15.680Z [INFO]  ReferenceTransformer: reference not found: "var.instance_type"
2023-06-19T03:04:15.680Z [INFO]  ReferenceTransformer: reference not found: "var.ami_id"
2023-06-19T03:04:15.680Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config" references: []
2023-06-19T03:04:15.680Z [DEBUG] Resource instance state not found for node "module.ec2.aws_instance.ec2_instance", instance module.ec2.aws_instance.ec2_instance
2023-06-19T03:04:15.680Z [INFO]  ReferenceTransformer: reference not found: "var.subnet_id"
2023-06-19T03:04:15.680Z [INFO]  ReferenceTransformer: reference not found: "var.instance_type"
2023-06-19T03:04:15.680Z [INFO]  ReferenceTransformer: reference not found: "var.ami_id"
2023-06-19T03:04:15.681Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance" references: []
2023-06-19T03:04:15.681Z [DEBUG] refresh: module.ec2.aws_instance.ec2_instance: no state, so not refreshing
2023-06-19T03:04:15.681Z [DEBUG] refresh: module.ec2.aws_launch_configuration.launch_config: no state, so not refreshing
2023-06-19T03:04:15.686Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.ec2.aws_launch_configuration.launch_config, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_monitoring: planned value cty.True for a non-computed attribute
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-06-19T03:04:15.686Z [DEBUG] Resource instance state not found for node "module.ec2.aws_autoscaling_group.autoscaling_group", instance module.ec2.aws_autoscaling_group.autoscaling_group
2023-06-19T03:04:15.687Z [INFO]  ReferenceTransformer: reference not found: "var.min_size"
2023-06-19T03:04:15.687Z [INFO]  ReferenceTransformer: reference not found: "var.subnet_id"
2023-06-19T03:04:15.687Z [INFO]  ReferenceTransformer: reference not found: "var.desired_capacity"
2023-06-19T03:04:15.687Z [INFO]  ReferenceTransformer: reference not found: "var.max_size"
2023-06-19T03:04:15.687Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" references: []
2023-06-19T03:04:15.687Z [DEBUG] refresh: module.ec2.aws_autoscaling_group.autoscaling_group: no state, so not refreshing
2023-06-19T03:04:15.691Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.ec2.aws_instance.ec2_instance, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .get_password_data: planned value cty.False for a non-computed attribute
      - .user_data_replace_on_change: planned value cty.False for a non-computed attribute
      - .source_dest_check: planned value cty.True for a non-computed attribute
      - .ephemeral_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_interface: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .enclave_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .capacity_reservation_specification: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .cpu_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .instance_market_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .maintenance_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .private_dns_name_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-06-19T03:04:15.696Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.ec2.aws_autoscaling_group.autoscaling_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_delete: planned value cty.False for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-06-19T03:04:15.697Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-19T03:04:15.698Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/5.4.0/linux_amd64/terraform-provider-aws_v5.4.0_x5 pid=111
2023-06-19T03:04:15.698Z [DEBUG] provider: plugin exited
2023-06-19T03:04:15.699Z [DEBUG] created provider logger: level=debug
2023-06-19T03:04:15.699Z [INFO]  provider: configuring client automatic mTLS
2023-06-19T03:04:15.711Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5]
2023-06-19T03:04:15.714Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5 pid=130
2023-06-19T03:04:15.714Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5
2023-06-19T03:04:15.725Z [INFO]  provider.terraform-provider-null_v3.2.1_x5: configuring server automatic mTLS: timestamp=2023-06-19T03:04:15.725Z
2023-06-19T03:04:15.744Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: plugin address: address=/tmp/plugin842285172 network=unix timestamp=2023-06-19T03:04:15.743Z
2023-06-19T03:04:15.744Z [DEBUG] provider: using plugin: version=5
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider Metadata: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server_getproviderschema.go:39 timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider Metadata: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server_getproviderschema.go:41 @module=sdk.framework timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider GetSchema: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:260 @module=sdk.framework timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider GetSchema: tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:262 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider Resources: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:330 @module=sdk.framework timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider Resources: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:332 timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Resource GetSchema: tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:411 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_resource_type=null_resource timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.767Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Resource GetSchema: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_resource_type=null_resource tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:413 @module=sdk.framework timestamp=2023-06-19T03:04:15.767Z
2023-06-19T03:04:15.768Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined Provider DataSources: tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:152 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 timestamp=2023-06-19T03:04:15.768Z
2023-06-19T03:04:15.768Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined Provider DataSources: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:154 @module=sdk.framework timestamp=2023-06-19T03:04:15.768Z
2023-06-19T03:04:15.768Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Calling provider defined DataSource GetSchema: tf_data_source_type=null_data_source tf_rpc=GetProviderSchema tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:233 @module=sdk.framework timestamp=2023-06-19T03:04:15.768Z
2023-06-19T03:04:15.768Z [DEBUG] provider.terraform-provider-null_v3.2.1_x5: Called provider defined DataSource GetSchema: tf_provider_addr=registry.terraform.io/hashicorp/null tf_req_id=62915f78-19f1-4fab-24ac-d4c2d8ff9ad9 tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v0.16.0/internal/fwserver/server.go:235 @module=sdk.framework tf_data_source_type=null_data_source timestamp=2023-06-19T03:04:15.768Z
2023-06-19T03:04:15.769Z [DEBUG] No provider meta schema returned
2023-06-19T03:04:15.769Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-19T03:04:15.770Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.1/linux_amd64/terraform-provider-null_v3.2.1_x5 pid=130
2023-06-19T03:04:15.770Z [DEBUG] provider: plugin exited
2023-06-19T03:04:15.770Z [DEBUG] created provider logger: level=debug
2023-06-19T03:04:15.771Z [INFO]  provider: configuring client automatic mTLS
2023-06-19T03:04:15.782Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5]
2023-06-19T03:04:15.785Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5 pid=139
2023-06-19T03:04:15.785Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5
2023-06-19T03:04:15.795Z [INFO]  provider.terraform-provider-random_v3.5.1_x5: configuring server automatic mTLS: timestamp=2023-06-19T03:04:15.795Z
2023-06-19T03:04:15.815Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: plugin address: address=/tmp/plugin3672492657 network=unix timestamp=2023-06-19T03:04:15.814Z
2023-06-19T03:04:15.815Z [DEBUG] provider: using plugin: version=5
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider Metadata: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server_getproviderschema.go:36 @module=sdk.framework timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider Metadata: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server_getproviderschema.go:38 timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider Schema: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:272 @module=sdk.framework timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider Schema: tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:274 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider Resources: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:349 timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider Resources: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:351 @module=sdk.framework timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema tf_resource_type=random_password timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.832Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @module=sdk.framework tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 tf_rpc=GetProviderSchema tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_password timestamp=2023-06-19T03:04:15.832Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: @module=sdk.framework tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_pet tf_rpc=GetProviderSchema timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 @module=sdk.framework tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_pet timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_resource_type=random_shuffle tf_rpc=GetProviderSchema tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @module=sdk.framework tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_resource_type=random_shuffle tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 tf_provider_addr=registry.terraform.io/hashicorp/random timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema tf_resource_type=random_string @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 tf_resource_type=random_string timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_uuid @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_resource_type=random_uuid @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 @module=sdk.framework tf_rpc=GetProviderSchema timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_resource_type=random_id timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: @module=sdk.framework tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 tf_provider_addr=registry.terraform.io/hashicorp/random tf_resource_type=random_id tf_rpc=GetProviderSchema timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Resource Schema: tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:433 @module=sdk.framework tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_resource_type=random_integer timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Resource Schema: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_resource_type=random_integer tf_rpc=GetProviderSchema @module=sdk.framework @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:435 timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Calling provider defined Provider DataSources: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:152 @module=sdk.framework timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.833Z [DEBUG] provider.terraform-provider-random_v3.5.1_x5: Called provider defined Provider DataSources: tf_provider_addr=registry.terraform.io/hashicorp/random tf_req_id=b9a32371-5554-e1ce-9d2d-eb9941139d2c tf_rpc=GetProviderSchema @caller=github.com/hashicorp/terraform-plugin-framework@v1.2.0/internal/fwserver/server.go:154 @module=sdk.framework timestamp=2023-06-19T03:04:15.833Z
2023-06-19T03:04:15.834Z [DEBUG] No provider meta schema returned
2023-06-19T03:04:15.835Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-06-19T03:04:15.836Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.5.1/linux_amd64/terraform-provider-random_v3.5.1_x5 pid=139
2023-06-19T03:04:15.836Z [DEBUG] provider: plugin exited
2023-06-19T03:04:15.836Z [DEBUG] building apply graph to check for errors
2023-06-19T03:04:15.837Z [DEBUG] Resource state not found for node "module.ec2.aws_launch_configuration.launch_config", instance module.ec2.aws_launch_configuration.launch_config
2023-06-19T03:04:15.837Z [DEBUG] Resource state not found for node "module.ec2.aws_instance.ec2_instance", instance module.ec2.aws_instance.ec2_instance
2023-06-19T03:04:15.837Z [DEBUG] Resource state not found for node "module.ec2.aws_autoscaling_group.autoscaling_group", instance module.ec2.aws_autoscaling_group.autoscaling_group
2023-06-19T03:04:15.837Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance" (*terraform.NodeApplyableResourceInstance) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:15.837Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" (*terraform.nodeExpandApplyableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:15.837Z [DEBUG] ProviderTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" (*terraform.NodeApplyableResourceInstance) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:15.837Z [DEBUG] ProviderTransformer: "module.ec2.aws_instance.ec2_instance (expand)" (*terraform.nodeExpandApplyableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:15.837Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" (*terraform.nodeExpandApplyableResource) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:15.837Z [DEBUG] ProviderTransformer: "module.ec2.aws_launch_configuration.launch_config" (*terraform.NodeApplyableResourceInstance) needs module.ec2.provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:15.837Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/null"]
2023-06-19T03:04:15.837Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/random"]
2023-06-19T03:04:15.837Z [DEBUG] pruning unused provider["registry.terraform.io/hashicorp/aws"]
2023-06-19T03:04:15.837Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.var.max_size (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.var.instance_type (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.provider[\"registry.terraform.io/hashicorp/aws\"]" references: [module.ec2.var.aws_region (expand)]
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2 (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.var.subnet_id (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.var.desired_capacity (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.var.ami_id (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.aws_autoscaling_group.autoscaling_group" references: [module.ec2.var.subnet_id (expand) module.ec2.var.desired_capacity (expand) module.ec2.aws_launch_configuration.launch_config (expand) module.ec2.aws_launch_configuration.launch_config module.ec2.aws_launch_configuration.launch_config module.ec2.var.min_size (expand) module.ec2.var.max_size (expand)]
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.var.min_size (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2 (close)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.var.aws_region (expand)" references: []
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.aws_launch_configuration.launch_config" references: [module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand)]
2023-06-19T03:04:15.838Z [DEBUG] ReferenceTransformer: "module.ec2.aws_instance.ec2_instance" references: [module.ec2.var.subnet_id (expand) module.ec2.var.instance_type (expand) module.ec2.var.ami_id (expand)]
2023-06-19T03:04:15.840Z [INFO]  backend/local: plan operation completed
2023-06-19T03:04:15.840Z [INFO]  backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-qiC51i1Vcmt7NScu/config/terraform.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_autoscaling_group.autoscaling_group will be created
  + resource "aws_autoscaling_group" "autoscaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = "example-launch-config"
      + load_balancers            = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "example-autoscaling-group"
      + name_prefix               = (known after apply)
      + predicted_capacity        = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-9fc9dea1",
        ]
      + wait_for_capacity_timeout = "10m"
      + warm_pool_size            = (known after apply)
    }

  # module.ec2.aws_instance.ec2_instance will be created
  + resource "aws_instance" "ec2_instance" {
      + ami                                  = "ami-022e1a32d3f742bd8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-9fc9dea1"
      + tags                                 = {
          + "Name" = "EC2Instance"
        }
      + tags_all                             = {
          + "Name" = "EC2Instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.ec2.aws_launch_configuration.launch_config will be created
  + resource "aws_launch_configuration" "launch_config" {
      + arn                         = (known after apply)
      + associate_public_ip_address = (known after apply)
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-022e1a32d3f742bd8"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = "example-launch-config"
      + name_prefix                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 2 estimated
           $33.408/mo +$33.408
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*